IsInPlace Property
 True if the family is an in-place family, false if the family is a loadable family.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool IsInPlace { get; }
  Visual Basic
Public ReadOnly Property IsInPlace As Boolean
	Get
  Visual C++
public:
property bool IsInPlace {
	bool get ();
}
 See Also
  Family Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →